{
	"npcs" :
	[
		{
			"name" : "Dice Master Trent",
			"stats": {
				"strength": 18,
				"expertise": 12,
				"luck": 9
			},
			"messages": [
				{
					"message": "First i'll teach you about your stats.\nOn the top left corner you have... ",
					"ignore": false,
					"phase": 0,
					"yesno": false,
					"method": ""
				},
				{
					"message": "...your Strength, if it's value reaches 0 you lose!\n...your Expertise, this will help you determine the damage you'll inflict on your oponent!\n...your Luck, this can make you inflict more or receive less damage! ",
					"ignore": false,
					"phase": 0,
					"yesno": false,
					"method": ""
				},
				{
					"message": "...and the Damage you will inflict on your foe, this is set using the Expertise and the value from the Dice.\nThe same exact stats are shown on the right top corner. However this belongs to your foe. ",
					"ignore": false,
					"phase": 0,
					"yesno": false,
					"method": ""
				},
				{
					"message": "Remember your choices during your path will make you fight stronger or weaker monsters. ",
					"ignore": false,
					"phase": 0,
					"yesno": false,
					"method": ""
				},
				{
					"message": "Now, in the left bottom corner you'll find the potions you can use.\nThe numbers below each one are the keys you need to press if you wan't to use them.\nLeft to right you'll have Expertise Potion, Strength Potion and Luck Potion. ",
					"ignore": false,
					"phase": 0,
					"yesno": false,
					"method": ""
				},
				{
					"message": "This potions will restore the stats they refer to, but be careful when you choose to use them! ",
					"ignore": false,
					"phase": 0,
					"yesno": false,
					"method": ""
				},
				{
					"message": "The empty floor area is where you and your foe will throw your Dice in order to set the Damage values.\nNow that you now the basics let's check your battle skills!\n(Press Left Mouse Button to throw the Dice) ",
					"ignore": false,
					"phase": 0,
					"yesno": false,
					"method": ""
				},
				{
					"message": "You are a quick learner I see!\nBut now I will teach you! ",
					"ignore": false,
					"phase": 10,
					"yesno": false,
					"method": ""
				},
				{
					"message": "Better luck next time...\nNow I roll! ",
					"ignore": false,
					"phase": 11,
					"yesno": false,
					"method": ""
				},
				{
					"message": "Draw? Really?\nYou are getting stronger! ",
					"ignore": false,
					"phase": 12,
					"yesno": false,
					"method": ""
				},
				{
					"message": "This is the Luck phase you need to roll the dice again.\nYou got lucky if the dice result is lower than your Luck Points. ",
					"ignore": false,
					"phase": 20,
					"yesno": false,
					"method": ""
				},
				{
					"message": "Everytime try your Luck you lose 1 point.\nKnow that if you have Luck after hitting your opponent it loses 2 extra Strength points otherwise the creature will recover 1 point. ",
					"ignore": false,
					"phase": 20,
					"yesno": false,
					"method": ""
				},
				{
					"message": "And if you have Luck after being hit by your opponent you recover 1 Strength Point or else you lose 1 more point. ",
					"ignore": false,
					"phase": 20,
					"yesno": false,
					"method": ""
				},
				{
					"message": "Now that you know how it works...\nLet's try your luck? ",
					"ignore": false,
					"phase": 21,
					"yesno": true,
					"method": "TryLuck"
				}


			]
		}
	]
}